In [76]:
from sqlalchemy import create_engine, MetaData, Table, inspect

In [77]:
import pandas as pd

In [78]:
engine = create_engine('sqlite:///:memory:')

In [79]:
dados = pd.read_csv('https://raw.githubusercontent.com/alura-cursos/Pandas/main/clientes_banco.csv')

In [80]:
dados.head()

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008804,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
1,5008805,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
2,5008806,58,Ensino médio,Casado,2,Empregado,Segurança,3,112500.0,1,Casa/apartamento próprio
3,5008808,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio
4,5008809,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio

In [81]:
from sqlalchemy import text

In [82]:
dados.to_sql('Clientes', engine, index=False)

438463

In [83]:
inspector = inspect(engine)
print(inspector.get_table_names())

['Clientes']

In [84]:
query = 'UPDATE Clientes SET Rendimento_anual=300000 WHERE ID_Cliente = 6840104 '
with engine.connect() as conn:
    result = conn.execute(text(query))
    conn.commit()

In [85]:
pd.read_sql('SELECT * FROM Clientes WHERE ID_Cliente =6840104 ', engine)

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,6840104,62,Ensino médio,Divorciado,1,Pensionista,Outro,0,300000.0,0,Casa/apartamento próprio

In [86]:
query = 'DELETE FROM Clientes WHERE ID_Cliente = 5008809'
with engine.connect() as conn:
    result = conn.execute(text(query))
    conn.commit()

In [87]:
pd.read_sql('SELECT * FROM Clientes WHERE ID_Cliente = 6840104', engine)

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,6840104,62,Ensino médio,Divorciado,1,Pensionista,Outro,0,300000.0,0,Casa/apartamento próprio

In [90]:
query = 'INSERT INTO Clientes (ID_Cliente, Idade, Grau_escolaridade, Estado_civil, ' \
        'Tamanho_familia, Categoria_de_renda, Ocupacao, Anos_empregado, ' \
        'Rendimento_anual, Tem_carro, Moradia) VALUES(6850985, 33, "Doutorado", "Solteiro", 1, "Empregado", "TI", ' \
        '2, 290000, 0, "Casa/apartamento próprio")'
with engine.connect() as conn:
    result = conn.execute(text(query))
    conn.commit()

In [92]:
pd.read_sql('SELECT* FROM Clientes WHERE ID_Cliente = 6850985', engine)

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,6850985,33,Doutorado,Solteiro,1,Empregado,TI,2,290000.0,0,Casa/apartamento próprio